#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.api_secret_key_base will be updated in-place
  ~ resource "kubernetes_secret" "api_secret_key_base" {
      ~ data = (sensitive value)
        id   = "default/api-secret-key-base"
        type = "Opaque"

        metadata {
            annotations      = {}
            generation       = 0
            labels           = {}
            name             = "api-secret-key-base"
            namespace        = "default"
            resource_version = "1477"
            self_link        = "/api/v1/namespaces/default/secrets/api-secret-key-base"
            uid              = "19d73072-7b31-4a11-a8ed-355c5ff10790"
        }
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.local_connection_token will be created
  + resource "kubernetes_secret" "local_connection_token" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "local-connection-token"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.kubernetes_config.random_password.api_secret_key_base will be created
  + resource "random_password" "api_secret_key_base" {
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.infrastructure.module.kubernetes_config.random_password.local_connection_token will be created
  + resource "random_password" "local_connection_token" {
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "api_secret_key_base" but a
value was found in file "/terraform/terraform.tfvars". To use this value, add
a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```

</details>

*Workflow: `Test infrastructure`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
